Repository: Uberariy/NetJudge-1
Catalog: report_analyser/po/*/LC_MESSAGES/netjudge.po
Languages: ru

source: Success
ru: Успешно!

source: Instruction json file contains invalid structures!
ru: Файл с инструкциями содержит некорректные структуры!

source: It must be list: [{'regex': STRING, 'inout': in/out 'files': [STRING, STRING]}, ...
ru: Должен быть список: [{'regex': STRING, 'inout': in/out 'files': [STRING, STRING]}, ...

source: Checking participant '{}':
ru: Проверка участника '{}':

source: Checking file {}:
ru: Проверяем файл {}:

source: Match {} in line {}:
ru: Соответствие {} на строке {}:

source: No matches in {} lines!
ru: Нет соответствий, хотя просмотрели {} строк файла!

source: Files ({}put):
ru: Для файлов ({}put):

source: Every imported file ({}put).
ru: Для всех файлов ({}put).

source: ==[ Exiting! ]==
ru: ==[ Исход проверяльщика. ]==

source: Not enough arguments
ru: Добавить бы ещё аргументов...

source: Wrong argument {}. Use in/out.
ru: Неправильный параметр {}. Используйте in/out.

source: Testing regex:
ru: Тестируем регулярку:

source: =[ CHECKING... ]=
ru: =[ ПРОВЕРЯЕМ... ]=

source: ==[ CHECK ENDED ]==
ru: ==[ ПРОВЕРКА ОКОНЧЕНА ]==

source: [ NetJu ]:~$
ru: [ ИнетДжа ]:~$

source: ==[ Welcome to NET-JUDGE - Check enviroment for iproute2 library! ]==
ru: ==[ Добро Пожаловать в ИНЕТ-ДЖАДЖ - Среда проверки задач для библиотеки iproute2! ]==

source: ==[ All progress is reset!! ]==
ru: ==[ Весь прогресс работы сброшен!! ]==

source: =[ No reports imported ]=
ru: =[ Отчёты в систему не добавлены ]=

source: =[ Imported reports: ]=
ru: =[ Добавленные отчёты: ]=

source: =[ No instructions imported ]=
ru: =[ Инструкций в систему не добавлено ]=

source: =[ Imported instructions: ]=
ru: =[ Добавленные инструкции: ]=

source: Success: Saved REGEXs in {}
ru: Успех: Сохранили регулярки в {}

source: ==[ ENTERING REGEX TESTING MODE: ]==
ru: ==[ ПЕРЕХОДИМ В РЕЖИМ ТЕСТИРОВАНИЯ РЕГУЛЯРОК: ]==

source: ==[ EXITING REGEX TESTING MODE: ]==
ru: ==[ ПОКИДАЕМ РЕЖИМ ТЕСТИРОВАНИЯ РЕГУЛЯРОК: ]==

source: '{}' mode is set.
ru: Установленный режим: '{}'.

source: Wrong number of steps to be done: {}
ru: Введено неправильное число шагов проверки: {}

source: Or 'addreg REGEX, FILE1, FILE2...'
ru: Или 'addreg REGEX, FILE1, FILE2...'

source: ==[ CHECK STARTS: Going through {} steps ]==
ru: ==[ НАЧИНАЕТСЯ ПРОВЕРКА: Нас ожидает {} этапов ]==

source: =[ SYNTAX CHECK ]=
ru: =[ ПРОВЕРКА СИНТАКСИСА ]=

source: =[ SEMANTIC CHECK ]=
ru: =[ ПРОВЕРКА СЕМАНТИКИ ]=

source: ==[ RESULTS ]==
ru: ==[ РЕЗУЛЬТАТЫ ]==

source: Participant '{}' results:
ru: Результаты участника '{}':
